## 2 - Creating Your First Database And Table

To create a database, you need just one line of SQL, which we’ll run in a moment using pgAdmin. You can find this code, along with all the examples in this book, in the files you downloaded from
GitHub via the link at https://www.nostarch.com/practical-sql-2nd-edition/.

__Listing 2-1: Creating a database named analysis__

In [ ]:
CREATE DATABASE analysis;

### Using the CREATE TABLE Statement

For this exercise, we’ll use an often-discussed piece of data: teacher salaries. Listing 2-2 shows the SQL statement to create a table called teachers. Let’s review the code before you enter it into pgAdmin and execute it.

__Listing 2-2: Creating a table named teachers with six columns__

In [ ]:
CREATE TABLE teachers (
    id bigserial,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date date,
    salary numeric
);

The code begins with the two SQL keywords __CREATE__ and __TABLE 1__ that, together with the name teachers, signal PostgreSQL that the next bit of code describes a table to add to the database. Following an opening parenthesis, the statement includes a comma-separated list of column names along with their data types. For style purposes, each new line of code is on its own line and indented four spaces, which isn’t required but makes the code more readable.

Each column name represents one discrete data element defined by a data type. The __id column 2__ is of data type __bigserial__, a special integer type that auto-increments every time you add a row to the table. The first row receives the value of 1 in the id column, the second row 2, and so on.

Next, we create columns for the teacher’s first name and last name and for the school where they teach 3. Each is of the data type varchar, a text column with a maximum length specified by the number in parentheses.

The teacher’s __hire_date 4__ is set to the data type __date__, and the __salary column 5__ is __numeric__.

### Using the INSERT Statement

To insert some data into the table, you first need to erase the CREATE TABLE statement you just ran.

__Listing 2-3 Inserting data into the teachers table__

In [ ]:
INSERT INTO teachers (first_name, last_name, school, hire_date, salary)
VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),
       ('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
       ('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
       ('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
       ('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
       ('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);

This code block inserts names and data for six teachers. Here, the PostgreSQL syntax follows the ANSI SQL standard: after the __INSERT INTO__ keywords is the name of the table, and in parentheses are the columns to be filled 1. In the next row are the __VALUES__ keyword and the data to insert into each column in each row 2. You need to enclose the data for each row in a set of parentheses, and inside each set of parentheses, use a comma to separate each column value. The order of the values must also match the order of the columns specified after the table name. Each row of data ends with a comma, except the last row, which ends the entire statement with a semicolon 3.

Notice that certain values that we’re inserting are enclosed in single quotes, but some are not. This is a standard SQL requirement. Text and dates require quotes; numbers, including integers and decimals, don’t require quotes.

### TRY IT YOURSELF

Here are two exercises to help you explore concepts related to databases, tables, and data relationships:

Imagine you’re building a database to catalog all the animals at your local zoo. You want one table to track the kinds of animals in the collection and another table to track the specifics on each animal. Write __CREATE TABLE__ statements for each table that include some of the columns you need. Why did you include the columns you chose?

Now create __INSERT__ statements to load sample data into the tables. How can you view the data via the pgAdmin tool? Create an additional __INSERT__ statement for one of your tables. Purposely omit one of the required commas separating the entries in the __VALUES__ clause of the query. What is the error message? Would it help you find the error in the code?

Solutions to all exercises are available in the Try_It_Yourself.sql file included with the
book’s resources.

In [ ]:
#The first table will hold the animal types and their conservation status:

CREATE TABLE animal_types (
    animal_type_id bigint PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
    common_name text NOT NULL,
    scientific_name text NOT NULL,
    conservation_status text NOT NULL,
    CONSTRAINT common_name_unique UNIQUE (common_name)
);

In [1]:
# The second table will hold data on individual animals. Note that the column animal_type_id references the column of the same name in the table animal types.

CREATE TABLE menagerie (
   menagerie_id bigint PRIMARY KEY GENERATED ALWAYS AS IDENTITY,
   common_name text REFERENCES animal_types (common_name),
   date_acquired date NOT NULL,
   gender text,
   acquired_from text,
   name text,
   notes text
);

In [ ]:
# Data source: https://www.worldwildlife.org/species/directory?direction=desc&sort=extinction_status

INSERT INTO animal_types (common_name, scientific_name, conservation_status)
VALUES ('Bengal Tiger', 'Panthera tigris tigris', 'Endangered'),
       ('Arctic Wolf', 'Canis lupus arctos', 'Least Concern');

In [ ]:
INSERT INTO menagerie (common_name, date_acquired, gender, acquired_from, name, notes)
VALUES
('Bengal Tiger', '3/12/1996', 'F', 'Dhaka Zoo', 'Ariel', 'Healthy coat at last exam.'),
('Arctic Wolf', '9/30/2000', 'F', 'National Zoo', 'Freddy', 'Strong appetite.');

In [ ]:
# To view data via pgAdmin, in the object browser, right-click Tables and
# select Refresh. Then right-click the table name and select
# View/Edit Data > All Rows

In [ ]:
#In this case, the error message points to the missing comma.

INSERT INTO animal_types (common_name, scientific_name, conservation_status)
VALUES ('Javan Rhino', 'Rhinoceros sondaicus' 'Critically Endangered');